const text = `প্রিয় নেহা,

তোমার সাথে কিছু বলতে চাই। তোমাকে ছাড়া প্রতিদিন যেন একটা অংশ হারিয়ে যাচ্ছে। তোমার হাসি, তোমার ভালোবাসা, আর তোমার নিঃশর্ত সমর্থন—এই জিনিসগুলোই আমার সবচেয়ে বেশি দরকার। তোমার উপস্থিতি ছাড়া জীবনটা যেন একটু ম্লান হয়ে গেছে। তোমার বন্ধুত্বই সেই শূন্যতা পূরণ করতে পারে।

তুমি কি মনে রেখেছো, আমরা কত অসাধারণ স্মৃতি তৈরি করেছি? হঠাৎ করা সেই ট্রিপগুলো থেকে শুরু করে রাতের আকাশে তারা দেখার মুহূর্তগুলো—প্রতিটা স্মৃতি আমার মনে গেঁথে আছে। এই মুহূর্তগুলো শুধু সময়ের ছোট্ট টুকরো নয়, এগুলো আমাদের বন্ধনের ভিত গড়ে তোলার মূল ভিত্তি।

আমি আমাদের গভীর রাতের সেই কথোপকথনগুলোকে খুব মিস করি, যেখানে আমরা একে অপরকে মন খুলে সবকিছু বলতাম। কারও সাথে পুরোপুরি নিজেকে প্রকাশ করার যে আরাম, সেটা কেবল তোমার সাথেই পাই।

আসো, আমরা একে অপরকে প্রতিশ্রুতি দিই—দূরত্ব যেন আমাদের বন্ধুত্বের উজ্জ্বলতাকে কমিয়ে না ফেলে। আমি অপেক্ষা করছি সেই দিনের জন্য, যেদিন আবার দেখা হবে, আর আমরা হাসতে হাসতে নতুন স্মৃতি তৈরি করবো। ততদিন পর্যন্ত, আমি আমাদের সেই পুরনো স্মৃতিগুলো ধরে রাখবো আর তোমাকে আমার মনের গভীরে স্থান দিয়ে রাখবো।

প্রতিটা দিন, তোমার সাথে আবার দেখা করার অপেক্ষা করি, যেদিন আমরা একে অপরকে শক্ত করে জড়িয়ে ধরবো আর আগের মতোই আমাদের বন্ধুত্বের গল্প শুরু হবে। সেই মুহূর্ত আসার আগ পর্যন্ত, জানবে, তোমাকে খুব মিস করি আর তুমি আমার হৃদয়ে সবচেয়ে প্রিয়।`;

const paragraph = text.split("");
let i = 0;

function dashOut(arr) {
    if (i < arr.length) {
        document.querySelector("#letter").textContent += arr[i];
        i++;
        setTimeout(() => dashOut(arr), interval(arr[i]));
    }
}

function interval(letter) {
    return letter === ";" || letter === "." || letter === "," ? Math.floor(Math.random() * 500 + 500) : Math.floor(Math.random() * 130 + 5);
}

function showLetter() {
    document.querySelector("#letter").style.display = "block";
    dashOut(paragraph);
}

window.addEventListener('load', () => {
    const audio = document.querySelector('.audio');
    audio.play();
});
